#Begin

# for developer`s placement
# only for easy reading

a = int(input('stand in rows в сантиметрах це короче відстань між рядками шнурків по центру, вкажіть в сантиметрах бо так треба ) просто цифру без пробілу   :)>>'))  # відстань між рядами  (в сантиметрах)
b = int(input('stand between holes в сантиметрах а це відстань між дирками в рядку одному і другому середнє значення , ціле число>>')) # відстань між дирочками в ряду (в сантиметрах)
l = int(input('lenght free end of shoelace в сантиметрах тоже '+ ' це короче довжина вільного кінця шнурка який лишається після продівання в дирки, Тоже ціле цисло, бо так>>'))  # довжина вільного кінця шнурка (в сантиметрах)
N = int(input('so how many holes in even row - А це кількість дирочок скільки в кожному рядку є ')) # кількість дирочок в кожному ряду (в сантиметрах)

print ('Now we got info from you, stay on this page 5 second')
print ('Воно працює, а вже як воно працює нікого турбувати не повинно )')
goriz = a*(N-1)
vertik = b*(N-1)
l1 = ((l*2)+(goriz*2)+(vertik*2))
print (l1 + a,' -  Саме стільки сантиметрів шнурку потрібно купувати аби вистачило на Ваші черевики')
input('Press enter for exit')